MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/SVD/STM32C531.svd
        <register>
          <name>I3C_CRCAPR</name>
          <displayName>I3C_CRCAPR</displayName>
          <description>I3C controller-role capability register</description>
          <addressOffset>0x0CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPDHOFF</name>
              <description>delayed controller-role hand-off</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>this I3C does not needs additional time to process a controller-role hand-off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>this I3C needs additional time to process a controller-role hand-off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPGRP</name>
              <description>group management support (when acting as controller)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>this I3C does not support group address capabilities</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>this I3C supports group address capabilities (when becoming controller)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_GETMXDSR</name>
          <displayName>I3C_GETMXDSR</displayName>
          <description>I3C get max data speed register</description>
          <addressOffset>0x0D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HOFFAS</name>
              <description>Controller hand-off activity state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>activity state 0 is the initial activity state of this I3C before and when becoming controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>activity state 1 is the initial activity state of this I3C when becoming controller</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>activity state 2 is the initial activity state of this I3C when becoming controller</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>activity state 3 is the initial activity state of this I3C when becoming controller</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMT</name>
              <description>GETMXDS CCC format</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>format 1 (2 bytes with MaxWr with no defining byte, MaxRd)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>format 2 (5 bytes with MaxWr with no defining byte, MaxRd, MaxRdTurn)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>format 2 (5 bytes with MaxWr with no defining byte, MaxRd, and middle byte of MaxRdTurn)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>format 2 (5 bytes with MaxWr with no defining byte, MaxRd, MSB of MaxRdTurn)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDTURN</name>
              <description>programmed byte of the 3-byte MaxRdTurn (maximum read turnaround byte)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCO</name>
              <description>clock-to-data turnaround time (tless thansub&gt;SCOless than/sub&gt;)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>tless thansub&gt;SCOless than/sub&gt; less than or equal 12 ns</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>tless thansub&gt;SCOless than/sub&gt; &gt; 12 ns (refer to the datasheet for more details)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_EPIDR</name>
          <displayName>I3C_EPIDR</displayName>
          <description>I3C extended provisioned ID register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02080000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIPIID</name>
              <description>4-bit MIPI Instance ID</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDTSEL</name>
              <description>provisioned ID type selector</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIPIMID</name>
              <description>15-bit MIPI manufacturer ID</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
